<?php

return [
    'checkout' => [
        'cart' => [
            'integrity' => [
                'qty-missing'   => 'حداقل یک محصول باید بیش از 1 تعداد داشته باشد.',
            ],

            'inventory-warning' => 'تعداد درخواستی در دسترس نیست، لطفاً بعداً دوباره تلاش کنید.',
            'missing-links'     => 'پیوندهای قابل دانلود برای این محصول وجود ندارند.',
            'missing-options'   => 'گزینه‌ها برای این محصول وجود ندارند.',
        ],
    ],

    'datagrid' => [
        'copy-of-slug'                  => 'کپی-از-:value',
        'copy-of'                       => 'کپی از :value',
        'variant-already-exist-message' => 'نسخه با همان گزینه‌های ویژگی از قبل وجود دارد.',
    ],

    'response' => [
        'product-can-not-be-copied' => 'محصولات از نوع :type قابل کپی نیستند',
    ],

    'sort-by'  => [
        'options' => [
            'cheapest-first'  => 'ارزان‌ترین اول',
            'expensive-first' => 'گران‌ترین اول',
            'from-a-z'        => 'از A تا Z',
            'from-z-a'        => 'از Z تا A',
            'latest-first'    => 'جدیدترین اول',
            'oldest-first'    => 'قدیمی‌ترین اول',
        ],
    ],

    'type'     => [
        'abstract'     => [
            'offers' => 'خرید :qty به قیمت :price هر کدام و صرفه‌جویی :discount',
        ],

        'bundle'       => 'بسته',
        'configurable' => 'پیکربندی‌پذیر',
        'downloadable' => 'قابل دانلود',
        'grouped'      => 'گروه‌بندی‌شده',
        'simple'       => 'ساده',
        'virtual'      => 'مجازی',
    ],

    'products' => [
        'index' => [
            'already-taken' => 'نام :name از قبل استفاده شده است.',
            'create-btn'    => 'ایجاد محصول',
            'title'         => 'محصولات',

            'create' => [
                'back-btn'                => 'بازگشت',
                'configurable-attributes' => 'ویژگی‌های پیکربندی‌پذیر',
                'create-btn'              => 'ایجاد محصول',
                'family'                  => 'خانواده',
                'save-btn'                => 'ذخیره محصول',
                'sku'                     => 'شناسه SKU',
                'title'                   => 'ایجاد محصول جدید',
                'type'                    => 'نوع',
            ],

            'datagrid' => [
                'active'                 => 'فعال',
                'attribute-family'       => 'خانواده ویژگی',
                'attribute-family-value' => 'خانواده ویژگی - :attribute_family',
                'category'               => 'دسته‌بندی',
                'channel'                => 'کانال',
                'copy-of'                => 'رونویسی از :value',
                'copy-of-slug'           => 'رونویسی-:value',
                'delete'                 => 'حذف',
                'disable'                => 'غیرفعال‌سازی',
                'id'                     => 'شناسه',
                'id-value'               => 'شناسه - :id',
                'image'                  => 'تصویر',
                'mass-delete-success'    => 'محصولات انتخابی با موفقیت حذف شدند',
                'mass-update-success'    => 'محصولات انتخابی با موفقیت به‌روزرسانی شدند',
                'name'                   => 'نام',
                'out-of-stock'           => 'تمام شده',
                'price'                  => 'قیمت',
                'product-image'          => 'تصویر محصول',
                'qty'                    => 'تعداد',
                'qty-value'              => ':qty در دسترس است',
                'sku'                    => 'شناسه SKU',
                'sku-value'              => 'شناسه SKU - :sku',
                'status'                 => 'وضعیت',
                'type'                   => 'نوع',
                'update-status'          => 'به‌روزرسانی وضعیت',
            ],
        ],

        'edit' => [
            'preview'  => 'پیش‌نمایش',
            'remove'   => 'حذف',
            'save-btn' => 'ذخیره محصول',
            'title'    => 'ویرایش محصول',

            'channels' => [
                'title' => 'کانال‌ها',
            ],

            'price' => [
                'group' => [
                    'add-group-price'           => 'افزودن قیمت گروهی',
                    'all-groups'                => 'تمام گروه‌ها',
                    'create-btn'                => 'افزودن جدید',
                    'discount-group-price-info' => 'برای :qty تعداد با تخفیف :price',
                    'edit-btn'                  => 'ویرایش',
                    'empty-info'                => 'قیمت‌گذاری ویژه برای مشتریان تعلق گرفته به گروه‌های خاص.',
                    'fixed-group-price-info'    => 'برای تعداد :qty با قیمت ثابت :price',
                    'title'                     => 'قیمت گروه مشتری',

                    'create' => [
                        'all-groups'     => 'تمام گروه‌ها',
                        'create-title'   => 'ایجاد قیمت گروه مشتری',
                        'customer-group' => 'گروه مشتری',
                        'delete-btn'     => 'حذف',
                        'discount'       => 'تخفیف',
                        'fixed'          => 'ثابت',
                        'price'          => 'قیمت',
                        'price-type'     => 'نوع قیمت',
                        'qty'            => 'حداقل تعداد',
                        'save-btn'       => 'ذخیره',
                        'update-title'   => 'بروزرسانی قیمت گروه مشتری',
                    ],
                ],
            ],

            'inventories' => [
                'pending-ordered-qty'      => 'موجودی در حال انتظار برای تعداد سفارشی: :qty',
                'pending-ordered-qty-info' => 'تعداد در حال انتظار برای تعداد محصول سفارشی پس از ارسال از منبع موجودی مربوطه کم می‌شود. در صورت لغو، تعداد در حال انتظار برای فروش در دسترس خواهد بود.',
                'title'                    => 'موجودی‌ها',
            ],

            'categories' => [
                'title' => 'دسته‌بندی‌ها',
            ],

            'images' => [
                'info'  => 'رزولوشن تصویر باید مانند 560px X 609px باشد',
                'title' => 'تصاویر',
            ],

            'videos' => [
                'error' => 'خطا: اندازه :attribute نباید بیشتر از :max کیلوبایت باشد. لطفاً یک فایل کوچکتر انتخاب کنید.',
                'info'  => 'حداکثر اندازه ویدیو باید مانند :size باشد.',
                'title' => 'ویدیوها',
            ],

            'links' => [
                'related-products' => [
                    'empty-info' => 'محصولات مرتبط را به طور پویا اضافه کنید.',
                    'info'       => 'علاوه بر محصول مشتری مشاهده‌کننده، محصولات مرتبط به او ارائه می‌شود.',
                    'title'      => 'محصولات مرتبط',
                ],

                'up-sells' => [
                    'empty-info' => 'محصولات فروش بالا را به طور پویا اضافه کنید.',
                    'info'       => 'مشتری محصولات فروش بالا را مشاهده می‌کند که به عنوان جایگزین پرمیوم یا با کیفیت‌تری برای محصولی که در حال مشاهده است عرضه می‌شود.',
                    'title'      => 'محصولات فروش بالا',
                ],

                'cross-sells' => [
                    'empty-info' => 'محصولات فروش متقابل را به طور پویا اضافه کنید.',
                    'info'       => 'نزدیک به سبد خرید، شما محصولات خرید سریع متمم را به عنوان محصولات فروش متقابل می‌یابید تا به تکمیل مواردی که از پیش به سبد خرید خود اضافه شده‌اند کمک کند.',
                    'title'      => 'محصولات فروش متقابل',
                ],

                'add-btn'           => 'افزودن محصول',
                'delete'            => 'حذف',
                'empty-info'        => 'برای افزودن محصولات :type به طور پویا.',
                'empty-title'       => 'افزودن محصول',
                'image-placeholder' => 'تصویر محصول',
                'sku'               => 'شناسه SKU - :sku',
            ],

            'types' => [
                'configurable' => [
                    'add-btn'           => 'افزودن نسخه',
                    'delete-btn'        => 'حذف',
                    'edit-btn'          => 'ویرایش',
                    'empty-info'        => 'برای ایجاد ترکیب‌های مختلف محصول به طور پویا.',
                    'empty-title'       => 'افزودن نسخه',
                    'image-placeholder' => 'تصویر محصول',
                    'info'              => 'محصولات تغییریافته بر اساس تمام ترکیب‌های ممکن ویژگی‌ها تولید می‌شوند.',
                    'qty'               => ':qty تعداد',
                    'sku'               => 'شناسه SKU - :sku',
                    'title'             => 'تغییریافته‌ها',

                    'create' => [
                        'description'            => 'توضیحات',
                        'name'                   => 'نام',
                        'save-btn'               => 'افزودن',
                        'title'                  => 'افزودن نسخه',
                        'variant-already-exists' => 'این نسخه از پیش وجود دارد',
                    ],

                    'edit' => [
                        'disabled'        => 'غیرفعال',
                        'edit-info'       => 'اگر می‌خواهید اطلاعات محصول را به‌طور دقیق بروزرسانی کنید، به صفحه جزئیات محصول بروید',
                        'edit-link-title' => 'صفحه جزئیات محصول',
                        'enabled'         => 'فعال',
                        'images'          => 'تصاویر',
                        'name'            => 'نام',
                        'price'           => 'قیمت',
                        'quantities'      => 'تعداد',
                        'save-btn'        => 'ذخیره',
                        'sku'             => 'شناسه SKU',
                        'status'          => 'وضعیت',
                        'title'           => 'محصول',
                        'weight'          => 'وزن',
                    ],

                    'mass-edit' => [
                        'add-images'          => 'افزودن تصاویر',
                        'apply-to-all-btn'    => 'اعمال به همه',
                        'apply-to-all-name'   => 'اعمال یک نام برای تمامی نوع‌ها.',
                        'apply-to-all-sku'    => 'اعمال یک قیمت به تمامی SKU.',
                        'apply-to-all-status' => 'اعمال یک وضعیت به تمامی نوع‌ها.',
                        'apply-to-all-weight' => 'اعمال وزن بر روی تمامی واریانت‌ها.',
                        'edit-inventories'    => 'ویرایش موجودی‌ها',
                        'edit-names'          => 'ویرایش نام‌ها',
                        'edit-prices'         => 'ویرایش قیمت‌ها',
                        'edit-sku'            => 'ویرایش SKU',
                        'edit-status'         => 'ویرایش وضعیت',
                        'edit-weight'         => 'ویرایش وزن',
                        'name'                => 'نام',
                        'price'               => 'قیمت',
                        'remove-images'       => 'حذف تصاویر',
                        'remove-variants'     => 'حذف نوع‌ها',
                        'select-action'       => 'انتخاب عمل',
                        'select-variants'     => 'انتخاب نوع‌ها',
                        'status'              => 'وضعیت',
                        'variant-name'        => 'نام نوع',
                        'variant-sku'         => 'SKU نوع',
                        'weight'              => 'وزن',
                    ],
                ],

                'grouped' => [
                    'add-btn'           => 'افزودن محصول',
                    'default-qty'       => 'تعداد پیش‌فرض',
                    'delete'            => 'حذف',
                    'empty-info'        => 'برای ایجاد ترکیب‌های مختلف محصول به طور پویا.',
                    'empty-title'       => 'افزودن محصول',
                    'image-placeholder' => 'تصویر محصول',
                    'info'              => 'محصول گروهی شامل موارد مستقلی است که به عنوان یک مجموعه ارائه می‌شود، که امکان تغییرات یا هماهنگی بر اساس فصل یا موضوع را فراهم می‌کند. هر محصول می‌تواند به صورت مستقل یا به عنوان قسمتی از گروه خریداری شود.',
                    'sku'               => 'شناسه SKU - :sku',
                    'title'             => 'محصولات گروهی',
                ],

                'bundle' => [
                    'add-btn'           => 'افزودن گزینه',
                    'empty-info'        => 'برای ایجاد گزینه‌های بسته به طور پویا.',
                    'empty-title'       => 'افزودن گزینه',
                    'image-placeholder' => 'تصویر محصول',
                    'info'              => 'محصول بسته یک بسته از موارد یا خدمات چندگانه است که به عنوان یک واحد به قیمت ویژه عرضه می‌شود و به مشتریان ارزش و سهولت فراهم می‌کند.',
                    'title'             => 'آیتم‌های بسته',

                    'update-create' => [
                        'checkbox'    => 'چک باکس',
                        'is-required' => 'الزامی است',
                        'multiselect' => 'چندانتخابی',
                        'name'        => 'عنوان',
                        'no'          => 'خیر',
                        'radio'       => 'رادیو',
                        'save-btn'    => 'ذخیره',
                        'select'      => 'انتخاب',
                        'title'       => 'گزینه',
                        'type'        => 'نوع',
                        'yes'         => 'بله',
                    ],

                    'option' => [
                        'add-btn'     => 'افزودن محصول',
                        'default-qty' => 'تعداد پیش‌فرض',
                        'delete'      => 'حذف',
                        'delete-btn'  => 'حذف',
                        'edit-btn'    => 'ویرایش',
                        'empty-info'  => 'برای ایجاد ترکیب‌های مختلف محصول به طور پویا.',
                        'empty-title' => 'افزودن محصول',
                        'sku'         => 'شناسه SKU - :sku',

                        'types' => [
                            'checkbox' => [
                                'info'  => 'محصول پیش‌فرض را با استفاده از چک باکس تعیین کنید',
                                'title' => 'چک باکس',
                            ],

                            'multiselect' => [
                                'info'  => 'محصول پیش‌فرض را با استفاده از دکمه چک باکس تعیین کنید',
                                'title' => 'چندانتخابی',
                            ],

                            'radio' => [
                                'info'  => 'محصول پیش‌فرض را با استفاده از دکمه رادیو تعیین کنید',
                                'title' => 'رادیو',
                            ],

                            'select' => [
                                'info'  => 'محصول پیش‌فرض را با استفاده از دکمه رادیو تعیین کنید',
                                'title' => 'انتخاب',
                            ],
                        ],
                    ],
                ],

                'downloadable' => [
                    'links' => [
                        'add-btn'     => 'افزودن لینک',
                        'delete-btn'  => 'حذف',
                        'edit-btn'    => 'ویرایش',
                        'empty-info'  => 'برای ایجاد لینک به طور پویا.',
                        'empty-title' => 'افزودن لینک',
                        'file'        => 'فایل : ',
                        'info'        => 'نوع محصول قابل دانلود اجازه فروش محصولات دیجیتالی را مانند کتاب‌های الکترونیکی، برنامه‌های نرم‌افزاری، موسیقی، بازی‌ها و غیره فراهم می‌کند.',
                        'sample-file' => 'فایل نمونه : ',
                        'sample-url'  => 'آدرس نمونه : ',
                        'title'       => 'لینک‌های قابل دانلود',
                        'url'         => 'آدرس اینترنتی : ',

                        'update-create' => [
                            'downloads'   => 'دانلود مجاز است',
                            'file'        => 'فایل',
                            'file-type'   => 'نوع فایل',
                            'name'        => 'عنوان',
                            'price'       => 'قیمت',
                            'sample'      => 'نمونه',
                            'sample-type' => 'نوع نمونه',
                            'save-btn'    => 'ذخیره',
                            'title'       => 'لینک',
                            'url'         => 'آدرس اینترنتی : ',
                        ],
                    ],

                    'samples' => [
                        'add-btn'     => 'افزودن نمونه',
                        'delete-btn'  => 'حذف',
                        'edit-btn'    => 'ویرایش',
                        'empty-info'  => 'برای ایجاد نمونه به طور پویا.',
                        'empty-title' => 'افزودن نمونه',
                        'file'        => 'فایل : ',
                        'info'        => 'نوع محصول قابل دانلود اجازه فروش محصولات دیجیتالی را مانند کتاب‌های الکترونیکی، برنامه‌های نرم‌افزاری، موسیقی، بازی‌ها و غیره فراهم می‌کند.',
                        'title'       => 'نمونه‌های قابل دانلود',
                        'url'         => 'آدرس اینترنتی : ',

                        'update-create' => [
                            'file'        => 'فایل',
                            'file-type'   => 'نوع فایل',
                            'name'        => 'عنوان',
                            'save-btn'    => 'ذخیره',
                            'title'       => 'لینک',
                            'url'         => 'آدرس اینترنتی : ',
                        ],
                    ],
                ],
            ],
        ],

        'create-success'          => 'محصول با موفقیت ایجاد شد',
        'delete-failed'           => 'حذف محصول ناموفق بود',
        'delete-success'          => 'محصول با موفقیت حذف شد',
        'product-copied'          => 'محصول با موفقیت کپی شد',
        'saved-inventory-message' => 'محصول با موفقیت ذخیره شد',
        'update-success'          => 'محصول با موفقیت به‌روزرسانی شد',
    ],
];
